## pandas
--it is an important module in data sciece libraries 
--stands for pannel data 
-- data structors
    -series
    -dataframes
--which is we can do the data analysis,manupilation,cleaning
--data analysation
       --stastics of the data
       --volume off the data
- data manupilation
 --changing data from one form to another
 --merging and concatination
--data cleaning
 -removing unwanted data
 --deleting null values and nan values

In [1]:
import pandas as pd
pd.__version__

'1.2.4'

In [2]:
##we can create the pandas series  with list,string,tuple
print(dir(pd))

['BooleanDtype', 'Categorical', 'CategoricalDtype', 'CategoricalIndex', 'DataFrame', 'DateOffset', 'DatetimeIndex', 'DatetimeTZDtype', 'ExcelFile', 'ExcelWriter', 'Flags', 'Float32Dtype', 'Float64Dtype', 'Float64Index', 'Grouper', 'HDFStore', 'Index', 'IndexSlice', 'Int16Dtype', 'Int32Dtype', 'Int64Dtype', 'Int64Index', 'Int8Dtype', 'Interval', 'IntervalDtype', 'IntervalIndex', 'MultiIndex', 'NA', 'NaT', 'NamedAgg', 'Period', 'PeriodDtype', 'PeriodIndex', 'RangeIndex', 'Series', 'SparseDtype', 'StringDtype', 'Timedelta', 'TimedeltaIndex', 'Timestamp', 'UInt16Dtype', 'UInt32Dtype', 'UInt64Dtype', 'UInt64Index', 'UInt8Dtype', '__builtins__', '__cached__', '__doc__', '__docformat__', '__file__', '__getattr__', '__git_version__', '__loader__', '__name__', '__package__', '__path__', '__spec__', '__version__', '_config', '_hashtable', '_is_numpy_dev', '_lib', '_libs', '_np_version_under1p17', '_np_version_under1p18', '_testing', '_tslib', '_typing', '_version', 'api', 'array', 'arrays', 'bdate_range', 'compat', 'concat', 'core', 'crosstab', 'cut', 'date_range', 'describe_option', 'errors', 'eval', 'factorize', 'get_dummies', 'get_option', 'infer_freq', 'interval_range', 'io', 'isna', 'isnull', 'json_normalize', 'lreshape', 'melt', 'merge', 'merge_asof', 'merge_ordered', 'notna', 'notnull', 'offsets', 'option_context', 'options', 'pandas', 'period_range', 'pivot', 'pivot_table', 'plotting', 'qcut', 'read_clipboard', 'read_csv', 'read_excel', 'read_feather', 'read_fwf', 'read_gbq', 'read_hdf', 'read_html', 'read_json', 'read_orc', 'read_parquet', 'read_pickle', 'read_sas', 'read_spss', 'read_sql', 'read_sql_query', 'read_sql_table', 'read_stata', 'read_table', 'reset_option', 'set_eng_float_format', 'set_option', 'show_versions', 'test', 'testing', 'timedelta_range', 'to_datetime', 'to_numeric', 'to_pickle', 'to_timedelta', 'tseries', 'unique', 'util', 'value_counts', 'wide_to_long']

In [3]:
a=pd.Series("i am from ptk")
a

0    i am from ptk
dtype: object

In [3]:
b=input()
c=pd.Series(b.split(" "))
c

5rtg rtgf y6tfy

0     5rtg
1     rtgf
2    y6tfy
3
dtype: object

In [2]:
import pandas as pd
t=(1,2,3,4,5)
t1=pd.Series(t)
t1

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [4]:
d=pd.Series(range(20,26))
d

0    20
1    21
2    22
3    23
4    24
5    25
dtype: int64

In [5]:
dic={"list":[1,2,3],"tuple":(3,4,5),"string":"hii","int":123}
dic

{'list': [1, 2, 3], 'tuple': (3, 4, 5), 'string': 'hii', 'int': 123}

In [7]:
dic1=pd.Series(dic)
dic1

list      [1, 2, 3]
tuple     (3, 4, 5)
string          hii
int             123
dtype: object

In [9]:
dic1.index

Index(['list', 'tuple', 'string', 'int'], dtype='object')

In [11]:
import  numpy as np
arr=np.arange(10,50,5)
arr1=pd.Series(arr)
arr1

0    10
1    15
2    20
3    25
4    30
5    35
6    40
7    45
dtype: int32

In [13]:
arr1[0]

10

In [14]:
arr1.index

RangeIndex(start=0, stop=8, step=1)

In [19]:
arr1.index=[334,122,343,454,667,455,54637,5465]
arr1

334      10
122      15
343      20
454      25
667      30
455      35
54637    40
5465     45
dtype: int32

In [21]:
li=['hi','hello','good','hope']
ind=[i for i in range(15,19)]
pd.Series(li,index=ind)

15       hi
16    hello
17     good
18     hope
dtype: object

In [22]:
dic1

list      [1, 2, 3]
tuple     (3, 4, 5)
string          hii
int             123
dtype: object

In [23]:
dict2=pd.Series(dic,index=ind)

In [24]:
dict2

15    NaN
16    NaN
17    NaN
18    NaN
dtype: object

In [27]:
dict2.index

Int64Index([15, 16, 17, 18], dtype='int64')

In [47]:
import pandas as pd
import numpy as np
df1=pd.DataFrame(dic)# it has rows and columns

In [48]:
df2={56:"fifty","float":10.23,"prom":"workshop","name":"da"}
df2

{56: 'fifty', 'float': 10.23, 'prom': 'workshop', 'name': 'da'}

In [3]:
import pandas as pd
dt=pd.date_range('2022-02-02',periods=6)
dt

DatetimeIndex(['2022-02-02', '2022-02-03', '2022-02-04', '2022-02-05',
               '2022-02-06', '2022-02-07'],
              dtype='datetime64[ns]', freq='D')

In [11]:
pd.Series(dt,index=temp)

23   2022-02-02
34   2022-02-03
4    2022-02-04
56   2022-02-05
7    2022-02-06
8    2022-02-07
dtype: datetime64[ns]

##working with .csv files
--reading .csv files with "read_csv()" method
-syntax:pd.read_csv("file location")

In [1]:
import pandas as pd
data=pd.read_csv("marks.csv")
data

   Roll Name  Maths  Discrete  OS    CO    DS
0    A1    X     60        70  30  70.0  90.0
1    A2    Y     90        45  67  73.0  50.0
2    A1    G     60        70  30   NaN  90.0
3    A2    H     40        60  73  50.0   NaN
4    B1    I     50        70  90  90.0   NaN
5    B2    J     63        45  67  56.0  50.0
6    C1    K     67        70  30  75.0  40.0
7    C2    L     91        45  67  72.0  50.0
8    D1    M     40        70  50   NaN  90.0
9    D2    N      5        67  65  50.0   NaN
10   E1    X     50        70  30  80.0  90.0
11   E2    Y     60        45  77  73.0  40.0

In [2]:
data.sample()

  Roll Name  Maths  Discrete  OS    CO    DS
6   C1    K     67        70  30  75.0  40.0

In [3]:
data.head()

  Roll Name  Maths  Discrete  OS    CO    DS
0   A1    X     60        70  30  70.0  90.0
1   A2    Y     90        45  67  73.0  50.0
2   A1    G     60        70  30   NaN  90.0
3   A2    H     40        60  73  50.0   NaN
4   B1    I     50        70  90  90.0   NaN

In [4]:
data.head(3)

  Roll Name  Maths  Discrete  OS    CO    DS
0   A1    X     60        70  30  70.0  90.0
1   A2    Y     90        45  67  73.0  50.0
2   A1    G     60        70  30   NaN  90.0

In [5]:
data.tail()

   Roll Name  Maths  Discrete  OS    CO    DS
7    C2    L     91        45  67  72.0  50.0
8    D1    M     40        70  50   NaN  90.0
9    D2    N      5        67  65  50.0   NaN
10   E1    X     50        70  30  80.0  90.0
11   E2    Y     60        45  77  73.0  40.0

In [6]:
data.tail(4)

   Roll Name  Maths  Discrete  OS    CO    DS
8    D1    M     40        70  50   NaN  90.0
9    D2    N      5        67  65  50.0   NaN
10   E1    X     50        70  30  80.0  90.0
11   E2    Y     60        45  77  73.0  40.0

In [7]:
data["Roll"]

0     A1
1     A2
2     A1
3     A2
4     B1
5     B2
6     C1
7     C2
8     D1
9     D2
10    E1
11    E2
Name: Roll, dtype: object

In [9]:
data[["Roll","Name","Maths"]]

   Roll Name  Maths
0    A1    X     60
1    A2    Y     90
2    A1    G     60
3    A2    H     40
4    B1    I     50
5    B2    J     63
6    C1    K     67
7    C2    L     91
8    D1    M     40
9    D2    N      5
10   E1    X     50
11   E2    Y     60

In [11]:
new=pd.read_csv("marks.csv",usecols=["Name","Maths"])

In [12]:
new

   Name  Maths
0     X     60
1     Y     90
2     G     60
3     H     40
4     I     50
5     J     63
6     K     67
7     L     91
8     M     40
9     N      5
10    X     50
11    Y     60

In [13]:
data.columns

Index(['Roll', 'Name', 'Maths', 'Discrete', 'OS', 'CO', 'DS'], dtype='object')

In [14]:
data.index

RangeIndex(start=0, stop=12, step=1)

In [16]:
data.dtypes

Roll         object
Name         object
Maths         int64
Discrete      int64
OS            int64
CO          float64
DS          float64
dtype: object

In [17]:
data.info

<bound method DataFrame.info of    Roll Name  Maths  Discrete  OS    CO    DS
0    A1    X     60        70  30  70.0  90.0
1    A2    Y     90        45  67  73.0  50.0
2    A1    G     60        70  30   NaN  90.0
3    A2    H     40        60  73  50.0   NaN
4    B1    I     50        70  90  90.0   NaN
5    B2    J     63        45  67  56.0  50.0
6    C1    K     67        70  30  75.0  40.0
7    C2    L     91        45  67  72.0  50.0
8    D1    M     40        70  50   NaN  90.0
9    D2    N      5        67  65  50.0   NaN
10   E1    X     50        70  30  80.0  90.0
11   E2    Y     60        45  77  73.0  40.0>

In [19]:
data.describe()

           Maths   Discrete         OS         CO         DS
count  12.000000  12.000000  12.000000  10.000000   9.000000
mean   56.333333  60.583333  56.333333  68.900000  65.555556
std    22.928083  11.851032  21.465970  13.042239  23.511227
min     5.000000  45.000000  30.000000  50.000000  40.000000
25%    47.500000  45.000000  30.000000  59.500000  50.000000
50%    60.000000  68.500000  66.000000  72.500000  50.000000
75%    64.000000  70.000000  68.500000  74.500000  90.000000
max    91.000000  70.000000  90.000000  90.000000  90.000000

In [21]:
data.Maths.value_counts()

60    3
50    2
40    2
67    1
5     1
90    1
91    1
63    1
Name: Maths, dtype: int64

In [23]:
data["Maths"].value_counts()

60    3
50    2
40    2
67    1
5     1
90    1
91    1
63    1
Name: Maths, dtype: int64

In [25]:
data.shape

(12, 7)

In [26]:
data.sort_values("Maths")

   Roll Name  Maths  Discrete  OS    CO    DS
9    D2    N      5        67  65  50.0   NaN
3    A2    H     40        60  73  50.0   NaN
8    D1    M     40        70  50   NaN  90.0
4    B1    I     50        70  90  90.0   NaN
10   E1    X     50        70  30  80.0  90.0
0    A1    X     60        70  30  70.0  90.0
2    A1    G     60        70  30   NaN  90.0
11   E2    Y     60        45  77  73.0  40.0
5    B2    J     63        45  67  56.0  50.0
6    C1    K     67        70  30  75.0  40.0
1    A2    Y     90        45  67  73.0  50.0
7    C2    L     91        45  67  72.0  50.0

In [28]:
data.OS.sum()

676

In [29]:
data.CO.sum()

689.0

In [30]:
data.Maths.sum()

676

In [32]:
data.isnull()

     Roll   Name  Maths  Discrete     OS     CO     DS
0   False  False  False     False  False  False  False
1   False  False  False     False  False  False  False
2   False  False  False     False  False   True  False
3   False  False  False     False  False  False   True
4   False  False  False     False  False  False   True
5   False  False  False     False  False  False  False
6   False  False  False     False  False  False  False
7   False  False  False     False  False  False  False
8   False  False  False     False  False   True  False
9   False  False  False     False  False  False   True
10  False  False  False     False  False  False  False
11  False  False  False     False  False  False  False

In [33]:
data.isna()

     Roll   Name  Maths  Discrete     OS     CO     DS
0   False  False  False     False  False  False  False
1   False  False  False     False  False  False  False
2   False  False  False     False  False   True  False
3   False  False  False     False  False  False   True
4   False  False  False     False  False  False   True
5   False  False  False     False  False  False  False
6   False  False  False     False  False  False  False
7   False  False  False     False  False  False  False
8   False  False  False     False  False   True  False
9   False  False  False     False  False  False   True
10  False  False  False     False  False  False  False
11  False  False  False     False  False  False  False

In [34]:
data.nunique()

Roll        10
Name        10
Maths        8
Discrete     4
OS           7
CO           8
DS           3
dtype: int64